kurs = 42
nacenka = 1.45
promo_skidka = 0.95

size = [30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
        100, 105, 110, 115, 
        120, 125, 130, 135, 
        140, 145, 150, 155, 
        160, 165, 170, 175]

price = {30: 6.14, 31: 6.26, 32: 6.37, 33: 6.49, 34: 6.60, 35: 6.72, 36: 6.84, 37: 6.95, 38: 7.07, 39: 7.19,
         40: 7.30, 41: 7.42, 42: 7.53, 43: 7.65, 44: 7.77, 45: 7.88, 46: 8.00, 47: 8.11, 48: 8.23, 49: 8.35,
         50: 8.46, 51: 8.58, 52: 8.70, 53: 8.81, 54: 8.93, 55: 9.04, 56: 9.16, 57: 9.28, 58: 9.39, 59: 9.51,
         60: 9.62, 61: 9.74, 62: 9.86, 63: 9.97, 64: 10.09, 65: 10.20, 66: 10.32, 67: 10.44, 68: 10.55, 69: 10.67,
         70: 10.79, 71: 10.90, 72: 11.02, 73: 11.13, 74: 11.25, 75: 11.37, 76: 11.48, 77: 11.60, 78: 11.71, 79: 11.83,
         80: 11.95, 81: 12.06, 82: 12.18, 83: 12.30, 84: 12.41, 85: 12.53, 86: 12.64, 87: 12.76, 88: 12.88, 89: 12.99,
         90: 13.11, 91: 13.22, 92: 13.34, 93: 13.46, 94: 13.57, 95: 13.69, 96: 13.80, 97: 13.92, 98: 14.04, 99: 14.15,
         100: 14.27, 105: 14.85, 110: 15.43, 115: 16.01, 
         120: 16.59, 125: 17.17, 130: 18.23, 135: 18.83,
         140: 19.43, 145: 20.02, 150: 20.62, 155: 21.22,
         160: 21.81, 165: 22.41, 170: 23.01, 175: 23.61}
rolet = [
    [601, 'Белый', 'Білий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_belyy.jpg'],
    [614, 'Розовый', 'Рожевий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_rozovyy.jpg'],
    [618, 'Оранжевый', 'Оранжевий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_oranzhevyy.jpg'],
    [620, 'Голубой', 'Блакитний', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_goluboy.jpg'],
    [607, 'Желтый', 'Жовтий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_yarko_zheltyy.jpg'],
    [643, 'Красный', 'Червоний', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_malinovyy.jpg'],
    [621, 'Синий', 'Синій', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_siniy.jpg'],
    [633, 'Терракотовый', 'Теракотовий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_terrakot.jpg'],
    [634, 'Коричневый', 'Коричневий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_temno_korichnevyy.jpg'],
    [637, 'Бежевый', 'Бежевий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_bezhevyy.jpg'],
    [622, 'Зеленый', 'Зелений', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_zelenyy.jpg'],
    [649, 'Серый', 'Сірий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_seryy.jpg'],
    [631, 'Персиковый', 'Персиковий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_persik.jpg'],
    [623, 'Салатовый', 'Салатовий', 'https://raw.githubusercontent.com/relavus1981/rozetka/main/img-len/rolshtory_drezden_fistashkovyy.jpg'],
    ]

description = '''
<h2>Рулонная штора Дрезден ширина ткани {} см высота 170 см. Цвет {}.</h2>
<p>Превратите свой дом в оазис уюта с нашей рулонной шторой Дрезден 601 Miranda. Эта штора – идеальное сочетание элегантного дизайна, функциональности и высокого качества. Сделайте свое пространство уютным и стильным с этой изысканной тканевой ролетой.</p>
<h3>Особенности ролеты:</h3>
<p>Элегантный дизайн: Нежный оттенок и ткань Miranda придают шторе изысканный и стильный вид, подходящий для любого интерьера.</p>
<p>Простота установки и использования: Рулонные шторы легко устанавливаются и поднимаются с помощью цепочки, обеспечивая максимальное удобство в использовании.</p>
<p>Регулировка освещения: Идеальное решение для регулирования уровня света в комнате, позволяя создать уютную атмосферу.</p>
<p>Экологически чистые материалы: Ткань высокого качества, безопасная для здоровья, создает комфорт и природную гармонию в вашем доме.</p>
<p>Прекрасное сочетание с интерьером: Идеально подходит для любого стиля интерьера, от классического до современного.</p>
<h3>Преимущества при заказе у нас:</h3>
<p>Отсутствие предоплаты: Наслаждайтесь удобством — оплачивайте заказ при получении, без предварительной оплаты.</p>
<p>Широкий ассортимент: Выбирайте из разнообразия цветов и размеров, чтобы найти идеальное сочетание с вашим интерьером.</p>
<p>Обмен и возврат: В случае необходимости обмена или возврата, мы предоставляем гибкие условия для вашего комфорта.</p>
<p>Привнесите в свой дом нотки элегантности с рулонными жалюзи Дрезден 601 Miranda – вашим идеальным выбором для комфортного и стильного жилья.</p>
<h3>Комплектация рулонных штор Дрезден.</h3>
Ролета изготовлена из ткани Миранда польського производства. 
<ol>
<li> Ролета на алюминиевом валу.</li>
<li> Фурнитура польского производства.</li>
<li> Направляющие струны.</li>
<li> Фиксатор направляющей струны.</li>
<li> Цепочка управления. Можно установить справа или слева.</li>
<li> Ограничитель высоты шторы.</li>
<li> Фиксатор цепи.</li>
</ol>
'''

description_ua = '''
<h2>Рулонна штора Дрезден ширина ткани {} см висота 170 см. Колір {}.</h2>
<p>Перетворіть свій дім на оазис затишку за допомогою нашої рулонної штори Дрезден 601 Міранда. Ця штора - ідеальне поєднання елегантного дизайну, функціональності та високої якості. Зробіть свій простір затишним і стильним завдяки цій вишуканій тканинній ролеті.</p>
<h3>Особливості ролети:</h3>
<p>Елегантний дизайн: Ніжний відтінок і тканина Міранда надають шторі вишуканий і стильний вигляд, який підходить для будь-якого інтер'єру.</p>
<p>Простота установки та використання: Рулонні штори легко встановлюються і піднімаються за допомогою ланцюжка, забезпечуючи максимальний комфорт у використанні.</p>
<p>Регулювання освітлення: Ідеальне рішення для регулювання рівня світла в кімнаті, дозволяючи створити затишну атмосферу.</p>
<p>Екологічно чисті матеріали: Тканина високої якості, безпечна для здоров'я, створює комфорт і природну гармонію у вашому домі.</p>
<p>Прекрасне поєднання з інтер'єром: Ідеально підходить для будь-якого стилю інтер'єру, від класичного до сучасного.</p>
<h3>Переваги при замовленні у нас:</h3>
<p>Відсутність передоплати: Насолоджуйтеся зручністю - оплачуйте замовлення при отриманні, без попередньої оплати.</p>
<p>Широкий асортимент: Вибирайте з різноманіття кольорів і розмірів, щоб знайти ідеальне поєднання з вашим інтер'єром.</p>
<p>Обмін і повернення: У разі необхідності обміну або повернення ми надаємо гнучкі умови для вашого комфорту.</p>
<p>Внесіть в свій дім нотки елегантності з рулонними жалюзі Дрезден 601 Міранда - вашим ідеальним вибором для комфортного і стильного житла.</p>
<h3>Комплектація рулонних штор Дрезден.</h3>
Ролета виготовлена з тканини Міранда польського виробництва. 
<ol>
<li> Ролета на алюмінієвому валу.</li>
<li> Фурнітура польського виробництва.</li>
<li> Напрямні стрічки.</li>
<li> Фіксатор напрямної стрічки.</li>
<li> Ланцюжок управління. Можна встановити справа або зліва.</li>
<li> Обмежувач висоти штори.</li>
<li> Фіксатор ланцюжка.</li>
</ol>

'''