kurs = 41.1
nacenka = 1.45
promo_skidka = 0.95

size = [30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
        100, 105, 110, 115, 
        120, 125, 130, 135, 
        140, 145, 150, 155, 
        160, 165, 170, 175]

price = {30: 6.58, 31: 6.71, 32: 6.84, 33: 6.97, 34: 7.10, 35: 7.23, 36: 7.36, 37: 7.49, 38: 7.62, 39: 7.75,
         40: 7.88, 41: 8.01, 42: 8.14, 43: 8.27, 44: 8.40, 45: 8.53, 46: 8.66, 47: 8.79, 48: 8.92, 49: 9.05,
         50: 9.18, 51: 9.31, 52: 9.44, 53: 9.57, 54: 9.70, 55: 9.83, 56: 9.96, 57: 10.09, 58: 10.22, 59: 10.35,
         60: 10.48, 61: 10.61, 62: 10.74, 63: 10.87, 64: 11.00, 65: 11.13, 66: 11.26, 67: 11.39, 68: 11.52, 69: 11.65,
         70: 11.78, 71: 11.91, 72: 12.04, 73: 12.17, 74: 12.30, 75: 12.44, 76: 12.57, 77: 12.70, 78: 12.83, 79: 12.96,
         80: 13.09, 81: 13.22, 82: 13.35, 83: 13.48, 84: 13.61, 85: 13.74, 86: 13.87, 87: 14.00, 88: 14.13, 89: 14.26,
         90: 14.39, 91: 14.52, 92: 14.65, 93: 14.78, 94: 14.91, 95: 15.04, 96: 15.17, 97: 15.30, 98: 15.43, 99: 15.56,
         100: 15.69, 105: 16.34, 110: 16.99, 115: 17.64, 
         120: 18.29, 125: 18.95, 130: 19.60, 135: 20.25,
         140: 27.19, 145: 28.00, 150: 28.82, 155: 29.64,
         160: 30.45, 165: 31.27, 170: 32.08, 175: 32.90}
rolet = [
    ['5428/1', 'Белый', 'Білий', 'https://images.prom.ua/686311227_rulonna-shtora-tm.jpg'],
    ['5428/9', 'Песочный', 'Пісочний', 'https://images.prom.ua/686316748_rulonna-shtora-tm.jpg'],
    ['5428/3', 'Коричневый', 'Коричневий', 'https://images.prom.ua/686318300_rulonna-shtora-tm.jpg'],
    ['5428/2', 'Капучино', 'Капучино', 'https://images.prom.ua/686314879_rulonna-shtora-tm.jpg'],
    ['5428/7', 'Зеленый', 'Зелений', 'https://images.prom.ua/686319846_rulonna-shtora-tm.jpg'],
    ['5428/6', 'Серый', 'Сірий', 'https://images.prom.ua/686313300_rulonna-shtora-tm.jpg'],
    ]

description = '''
<h3>Рулонная штора Цветы ширина по ткани {} см высота 170 см. Цвет {}.</h3>
<h3>Как замерять ролету цветы.</h3>
<p>Нужно замерять ширину стекла оконной створки, на которое будет крепится ролета и прибавить 3 см. Если число получится не целое, то нужно округлить в большую сторону.</p> 
<p>Например: ширина стекла 53.5 см + 3 см = 56.5 см. Округляем в большую сторону = 57 см. Нужно выбрать ролету с шириной 57 см.</p> 
<p>Высота стандартная 170 см. При установке регулируется к размеру вашего окна.</p>

<h3>Комплектация рулонных штор блэкаут солнцеотражающих.</h3>
Ролета изготовлена из ткани Миранда польського производства. 
<ol>
<li> Ролета цветы на алюминиевом валу.</li>
<li> Качественная фурнитура польского производства.</li>
<li> Направляющие струны.</li>
<li> Фиксатор направляющей струны.</li>
<li> Цепочка управления. Можно установить справа или слева.</li>
<li> Ограничитель высоты шторы.</li>
<li> Фиксатор цепи.</li>
</ol>
Саморезы для крепления в комплект не входят.
'''

description_ua = '''
<h3>Рулонна штора квіти ширина по тканині {} см висота 170 см. Колір {}.</h3>
<h3>Як заміряти ролету квіти.</h3>
<p>Потрібно заміряти ширину скла віконної рами, на яке буде кріпитися ролета та додати 3 см. Якщо число вийде не ціле, то потрібно округлити в більшу сторрону.</p> 
<p>Наприклад: ширина скла 53.5 см + 3 см = 56.5 см. Округляємо в більшу сторону = 57 см. Потрібно вибрати ролету з шириною 57 см.</p> 
<p>Висота стандартна 170 см. Під час встановлення регулюється під розмір вашого вікна.</p>

<h3>Комплектация рулонных штор квіти.</h3>
Ролета виготовлена з тканини Міранда польського виробництва.  
<ol>
<li> Ролета квіти на алюмінієвому валу.</li>
<li> Якісна фурнітура польського виробництва.</li>
<li> Направляючі струни.</li>
<li> Фиксатор направляючих струн.</li>
<li> Цепочка управління. Можливе встановлення зправого або злівого боку.</li>
<li> Обмежувач висоти ролети.</li>
<li> Фіксатор цепка.</li>
</ol>
Саморізи для кріплення в комплект не входять.
'''