kurs = 41.1
nacenka = 1.45
promo_skidka = 0.95

size = [30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
        100, 105, 110, 115, 
        120, 125, 130, 135, 
        140, 145, 150, 155, 
        160, 165, 170, 175]

price = {30: 5.49, 31: 5.58, 32: 5.67, 33: 5.77, 34: 5.86, 35: 5.96, 36: 6.05, 37: 6.14, 38: 6.24, 39: 6.33,
         40: 6.43, 41: 6.52, 42: 6.61, 43: 6.71, 44: 6.80, 45: 6.90, 46: 6.99, 47: 7.08, 48: 7.18, 49: 7.27,
         50: 7.37, 51: 7.46, 52: 7.55, 53: 7.65, 54: 7.74, 55: 7.83, 56: 7.93, 57: 8.02, 58: 8.12, 59: 8.21,
         60: 8.30, 61: 8.40, 62: 8.49, 63: 8.59, 64: 8.68, 65: 8.77, 66: 8.87, 67: 8.96, 68: 9.06, 69: 9.15,
         70: 9.24, 71: 9.34, 72: 9.43, 73: 9.52, 74: 9.62, 75: 9.71, 76: 9.81, 77: 9.90, 78: 9.99, 79: 10.09,
         80: 10.18, 81: 10.28, 82: 10.37, 83: 10.46, 84: 10.56, 85: 10.65, 86: 10.75, 87: 10.84, 88: 10.93, 89: 11.03,
         90: 11.12, 91: 11.21, 92: 11.31, 93: 11.40, 94: 11.50, 95: 11.59, 96: 11.68, 97: 11.78, 98: 11.87, 99: 11.97,
         100: 12.06, 105: 12.53, 110: 13.00, 115: 13.47, 
         120: 13.94, 125: 14.41, 130: 14.88, 135: 15.35,
         140: 22.11, 145: 22.74, 150: 23.37, 155: 24.01,
         160: 24.64, 165: 25.28, 170: 25.91, 175: 26.55}
rolet = [
    [1864, 'Латте', 'Латте', 'https://images.prom.ua/4056685776_rulonna-shtora-rolets.jpg'],
    [1871, 'Розовый', 'Рожевий', 'https://images.prom.ua/4138235930_rulonna-shtora-rolets.jpg'],
    [1865, 'Оранжевый', 'Оранжевий', 'https://images.prom.ua/4056688194_rulonna-shtora-rolets.jpg'],
    [1817, 'Голубой', 'Блакитний', 'https://images.prom.ua/4056676012_rulonna-shtora-rolets.jpg'],
    [2117, 'Графитовый', 'Графітовий', 'https://images.prom.ua/4056695820_rulonna-shtora-rolets.jpg'],
    [897, 'Золотистый', 'Золотистий', 'https://images.prom.ua/4056625527_rulonna-shtora-rolets.jpg'],
    [1861, 'Зеленый', 'Зелений', 'https://images.prom.ua/4056679024_rulonna-shtora-rolets.jpg'],
    [2090, 'Серый', 'Сірий', 'https://images.prom.ua/4056693300_rulonna-shtora-rolets.jpg'],
    [1800, 'Молочный', 'Молочний', 'https://images.prom.ua/4056668628_rulonna-shtora-rolets.jpg'],
    [1816, 'Персиковый', 'Персиковий', 'https://images.prom.ua/4056672212_rulonna-shtora-rolets.jpg'],
    [1863, 'Синий', 'Синій', 'https://images.prom.ua/4056682201_rulonna-shtora-rolets.jpg'],
]

description = '''
<h3>Рулонная штора Перла ширина по ткани {} см высота 170 см. Цвет {}.</h3>
<h3>Как замерять ролеты Перла?</h3>
<p>Нужно замерять ширину стекла оконной створки, на которое будет крепится ролета и прибавить 3 см. Если число получится не целое, то нужно округлить в большую сторону.</p> 
<p>Например: ширина стекла 53.5 см + 3 см = 56.5 см. Округляем в большую сторону = 57 см. Нужно выбрать ролету с шириной 57 см.</p> 
<p>Высота стандартная 160 см. При установке регулируется к размеру вашего окна.</p>

<h3>Комплектация рулонных штор Перла.</h3>
Ролета изготовлена из ткани Миранда польського производства. 
<ol>
<li> Ролета Перла на алюминиевом валу.</li>
<li> Качественная фурнитура польского производства.</li>
<li> Направляющие струны.</li>
<li> Фиксатор направляющей струны.</li>
<li> Цепочка управления. Можно установить справа или слева.</li>
<li> Ограничитель высоты шторы.</li>
<li> Фиксатор цепи.</li>
</ol>
Саморезы для крепления в комплект не входят.
'''

description_ua = '''
<h3>Рулонна штора Перла ширина по тканині {} см висота 160 см. Колір {}.</h3>
<h3>Як заміряти ролету Перла.</h3>
<p>Потрібно заміряти ширину скла віконної рами, на яке буде кріпитися ролета та додати 3 см. Якщо число вийде не ціле, то потрібно округлити в більшу сторрону.</p> 
<p>Наприклад: ширина скла 53.5 см + 3 см = 56.5 см. Округляємо в більшу сторону = 57 см. Потрібно вибрати ролету з шириною 57 см.</p> 
<p>Висота стандартна 160 см. Під час встановлення регулюється під розмір вашого вікна.</p>

<h3>Комплектация рулонных штор Перла.</h3>
Ролета виготовлена з тканини Міранда польського виробництва.  
<ol>
<li> Ролета Перла на алюмінієвому валу.</li>
<li> Якісна фурнітура польського виробництва.</li>
<li> Направляючі струни.</li>
<li> Фиксатор направляючих струн.</li>
<li> Цепочка управління. Можливе встановлення зправого або злівого боку.</li>
<li> Обмежувач висоти ролети.</li>
<li> Фіксатор цепка.</li>
</ol>
Саморізи для кріплення в комплект не входять.
'''