kurs = 41.1
nacenka = 1.45
promo_skidka = 0.95

size = [30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
        100, 105, 110, 115, 
        120, 125, 130, 135, 
        140, 145, 150, 155, 
        160, 165, 170, 175]

price = {30: 5.85, 31: 5.96, 32: 6.07, 33: 6.17, 34: 6.28, 35: 6.38, 36: 6.49, 37: 6.60, 38: 66.70, 39: 6.81,
         40: 6.91, 41: 7.02, 42: 7.13, 43: 7.23, 44: 7.34, 45: 7.44, 46: 7.55, 47: 7.66, 48: 7.76, 49: 7.87,
         50: 7.98, 51: 8.08, 52: 8.19, 53: 8.29, 54: 8.40, 55: 8.51, 56: 8.61, 57: 8.72, 58: 8.82, 59: 8.93,
         60: 9.04, 61: 9.14, 62: 9.25, 63: 9.35, 64: 9.46, 65: 9.57, 66: 9.67, 67: 9.78, 68: 9.88, 69: 9.99,
         70: 10.10, 71: 10.20, 72: 10.31, 73: 10.42, 74: 11.58, 85: 11.69, 86: 11.79, 87: 11.90, 88: 12.01, 89: 12.11,
         90: 11.22, 91: 12.30, 92: 12.43, 93: 12.54, 94: 12.64, 95: 12.75, 96: 12.86, 97: 12.98, 98: 13.07, 99: 13.17,
         100: 13.28, 105: 13.81, 110: 14.34, 115: 14.87, 
         120: 15.40, 125: 15.93, 130: 16.46, 135: 16.99,
         140: 23.81, 145: 24.51, 150: 25.21, 155: 25.90,
         160: 26.60, 165: 27.29, 170: 27.99, 175: 28.68}

rolet = [
    [874, 'Синий', 'Синій', 'https://images.prom.ua/695719574_rulonna-shtora-tm.jpg'],
    [2095 , 'Красный', 'Червоний', 'https://images.prom.ua/695722252_rulonna-shtora-tm.jpg'],
    [2086, 'Оранжевый', "Жовтогарячий", 'https://images.prom.ua/695721100_rulonna-shtora-tm.jpg'],
    [1827 , 'Коричневый', 'Коричневий', 'https://images.prom.ua/695720103_rulonna-shtora-tm.jpg'],
    [2159, 'Зеленый', 'Зелений', 'https://images.prom.ua/695723059_rulonna-shtora-tm.jpg'],
    [2088, 'Бордовый', 'Бордовий', 'https://images.prom.ua/4056632329_rulonnaya-shtora-rolets.jpg'],
    [2021, 'Желтый', 'Жовтий', 'https://images.prom.ua/695720683_rulonna-shtora-tm.jpg'],
]

description = '''
<h3>Рулонная штора Агат ширина по ткани {} см высота 170 см. Цвет {}.</h3>
<h3>Как замерять ролеты Агат?</h3>
<p>Нужно замерять ширину стекла оконной створки, на которое будет крепится ролета и прибавить 3 см. Если число получится не целое, то нужно округлить в большую сторону.</p> 
<p>Например: ширина стекла 53.5 см + 3 см = 56.5 см. Округляем в большую сторону = 57 см. Нужно выбрать ролету с шириной 57 см.</p> 
<p>Высота стандартная 170 см. При установке регулируется к размеру вашего окна.</p>

<h3>Комплектация рулонных штор Агат.</h3>
Ролета изготовлена из ткани Миранда польського производства. 
<ol>
<li> Ролета Агат на алюминиевом валу.</li>
<li> Качественная фурнитура польского производства.</li>
<li> Направляющие струны.</li>
<li> Фиксатор направляющей струны.</li>
<li> Цепочка управления. Можно установить справа или слева.</li>
<li> Ограничитель высоты шторы.</li>
<li> Фиксатор цепи.</li>
</ol>
Саморезы для крепления в комплект не входят.
'''

description_ua = '''
<h3>Рулонна штора Агат ширина по тканині {} см висота 170 см. Колір {}.</h3>
<h3>Як заміряти ролету Агат.</h3>
<p>Потрібно заміряти ширину скла віконної рами, на яке буде кріпитися ролета та додати 3 см. Якщо число вийде не ціле, то потрібно округлити в більшу сторрону.</p> 
<p>Наприклад: ширина скла 53.5 см + 3 см = 56.5 см. Округляємо в більшу сторону = 57 см. Потрібно вибрати ролету з шириною 57 см.</p> 
<p>Висота стандартна 170 см. Під час встановлення регулюється під розмір вашого вікна.</p>

<h3>Комплектация рулонных штор Агат.</h3>
Ролета виготовлена з тканини Міранда польського виробництва.  
<ol>
<li> Ролета Агат на алюмінієвому валу.</li>
<li> Якісна фурнітура польського виробництва.</li>
<li> Направляючі струни.</li>
<li> Фиксатор направляючих струн.</li>
<li> Цепочка управління. Можливе встановлення з правого або з лівого боку.</li>
<li> Обмежувач висоти ролети.</li>
<li> Фіксатор цепка.</li>
</ol>
Саморізи для кріплення в комплект не входять.
'''