kurs = 41.1
nacenka = 1.45
promo_skidka = 0.95

size = [30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
        100, 105, 110, 115, 
        120, 125, 130, 135, 
        140, 145, 150, 155, 
        160, 165, 170, 175]

price = {30: 7.27, 31: 7.42, 32: 7.58, 33: 7.73, 34: 7.88, 35: 8.04, 36: 8.19, 37: 8.34, 38: 8.5, 39: 8.65,
         40: 8.80, 41: 8.96, 42: 9.11, 43: 9.26, 44: 9.42, 45: 9.57, 46: 9.72, 47: 9.88, 48: 10.03, 49: 10.18,
         50: 10.34, 51: 10.49, 52: 10.64, 53: 10.79, 54: 10.95, 55: 11.10, 56: 11.25, 57: 11.41, 58: 11.56, 59: 11.71,
         60: 11.87, 61: 12.02, 62: 12.17, 63: 12.33, 64: 12.48, 65: 12.63, 66: 12.79, 67: 12.94, 68: 13.09, 69: 13.25,
         70: 13.40, 71: 13.55, 72: 13.71, 73: 13.86, 74: 14.01, 75: 14.17, 76: 14.32, 77: 14.47, 78: 14.63, 79: 14.78,
         80: 14.93, 81: 15.09, 82: 15.24, 83: 15.39, 84: 15.55, 85: 15.70, 86: 15.85, 87: 16.01, 88: 16.16, 89: 16.31,
         90: 16.47, 91: 16.62, 92: 16.77, 93: 16.93, 94: 17.08, 95: 17.23, 96: 17.39, 97: 17.54, 98: 17.69, 99: 17.85,
         100: 18.00, 105: 18.77, 110: 19.53, 115: 20.30, 
         120: 21.07, 125: 21.83, 130: 22.60, 135: 23.37,
         140: 30.42, 145: 31.35, 150: 32.29, 155: 33.22,
         160: 34.15, 165: 35.08, 170: 36.01, 175: 36.94}
rolet = [
    [130, 'Белый', 'Білий', 'https://images.prom.ua/2564271836_w640_h640_2564271836.jpg'],
    [131, 'Розовый', 'Рожевий', 'https://images.prom.ua/2564269255_w640_h640_2564269255.jpg'],
    [132, 'Кремовый', 'Кремовий', 'https://images.prom.ua/2564271096_w640_h640_2564271096.jpg'],
    [133, 'Темно-синий', 'Темно-синій', 'https://images.prom.ua/2564271608_w640_h640_2564271608.jpg'],
    [134, 'Капучино', 'Капучино', 'https://images.prom.ua/2564270529_w640_h640_2564270529.jpg'],
    [135, 'Бежевый', 'Бежевий', 'https://images.prom.ua/2564270850_w640_h640_2564270850.jpg'],
    [136, 'Темно-серый', 'Темно-сірий', 'https://images.prom.ua/2564271305_w640_h640_2564271305.jpg'],
    [137, 'Зеленый', 'Зелений', 'https://images.prom.ua/2564271487_w640_h640_2564271487.jpg'],
    [138, 'Черный', 'Чорний', 'https://images.prom.ua/2564271738_w640_h640_2564271738.jpg'],
    [139, 'Серый', 'Сірий', 'https://images.prom.ua/2564270626_w640_h640_2564270626.jpg'],
    ]

description = '''
<h3>Рулонная штора блэкаут солнцезащитная ширина по ткани {} см высота 170 см. Цвет {}.</h3>
<h3>Как замерять ролеты день ночь.</h3>
<p>Нужно замерять ширину стекла оконной створки, на которое будет крепится ролета и прибавить 3 см. Если число получится не целое, то нужно округлить в большую сторону.</p> 
<p>Например: ширина стекла 53.5 см + 3 см = 56.5 см. Округляем в большую сторону = 57 см. Нужно выбрать ролету с шириной 57 см.</p> 
<p>Высота стандартная 170 см. При установке регулируется к размеру вашего окна.</p>

<h3>Комплектация рулонных штор блэкаут солнцеотражающих.</h3>
Ролета изготовлена из ткани Миранда польського производства. 
<ol>
<li> Ролета блэкаут на алюминиевом валу.</li>
<li> Качественная фурнитура польского производства.</li>
<li> Направляющие струны.</li>
<li> Фиксатор направляющей струны.</li>
<li> Цепочка управления. Можно установить справа или слева.</li>
<li> Ограничитель высоты шторы.</li>
<li> Фиксатор цепи.</li>
</ol>
Саморезы для крепления в комплект не входят.
'''

description_ua = '''
<h3>Рулонна штора блекаут сонцезахистна ширина по тканині {} см висота 170 см. Колір {}.</h3>
<h3>Як заміряти ролету блекаут.</h3>
<p>Потрібно заміряти ширину скла віконної рами, на яке буде кріпитися ролета та додати 3 см. Якщо число вийде не ціле, то потрібно округлити в більшу сторрону.</p> 
<p>Наприклад: ширина скла 53.5 см + 3 см = 56.5 см. Округляємо в більшу сторону = 57 см. Потрібно вибрати ролету з шириною 57 см.</p> 
<p>Висота стандартна 170 см. Під час встановлення регулюється під розмір вашого вікна.</p>

<h3>Комплектация рулонных сонцевідбивних штор блекаут.</h3>
Ролета виготовлена з тканини Міранда польського виробництва.  
<ol>
<li> Ролета блекаут на алюмінієвому валу.</li>
<li> Якісна фурнітура польського виробництва.</li>
<li> Направляючі струни.</li>
<li> Фиксатор направляючих струн.</li>
<li> Цепочка управління. Можливе встановлення зправого або злівого боку.</li>
<li> Обмежувач висоти ролети.</li>
<li> Фіксатор цепка.</li>
</ol>
Саморізи для кріплення в комплект не входять.
'''