kurs = 41.1
nacenka = 1.45
promo_skidka = 0.95

size = [30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
        100, 105, 110, 115, 
        120, 125, 130, 135, 
        140, 145, 150, 155, 
        160, 165, 170, 175]

price = {30: 5.49, 31: 5.58, 32: 5.67, 33: 5.77, 34: 5.86, 35: 5.96, 36: 6.05, 37: 6.14, 38: 6.24, 39: 6.33,
         40: 6.43, 41: 6.52, 42: 6.61, 43: 6.71, 44: 6.80, 45: 6.90, 46: 6.99, 47: 7.08, 48: 7.18, 49: 7.27,
         50: 7.37, 51: 7.46, 52: 7.55, 53: 7.65, 54: 7.74, 55: 7.83, 56: 7.93, 57: 8.02, 58: 8.12, 59: 8.21,
         60: 8.30, 61: 8.40, 62: 8.49, 63: 8.59, 64: 8.68, 65: 8.77, 66: 8.87, 67: 8.96, 68: 9.06, 69: 9.15,
         70: 9.24, 71: 9.34, 72: 9.43, 73: 9.52, 74: 9.62, 75: 9.71, 76: 9.81, 77: 9.90, 78: 9.99, 79: 10.09,
         80: 10.18, 81: 10.28, 82: 10.37, 83: 10.46, 84: 10.56, 85: 10.65, 86: 10.75, 87: 10.84, 88: 10.93, 89: 11.03,
         90: 11.12, 91: 11.21, 92: 11.31, 93: 11.40, 94: 11.50, 95: 11.59, 96: 11.68, 97: 11.78, 98: 11.87, 99: 11.97,
         100: 12.06, 105: 12.53, 110: 13.00, 115: 13.47, 
         120: 13.94, 125: 14.41, 130: 14.88, 135: 15.35,
         140: 22.11, 145: 22.74, 150: 23.37, 155: 24.01,
         160: 24.64, 165: 25.28, 170: 25.91, 175: 26.55}
rolet = [
    [800, 'Белый', 'Білий', 'https://images.prom.ua/4078400537_rulonna-shtora-tm.jpg'],
    [812, 'Латте', 'Латте', 'https://images.prom.ua/4078401459_rulonna-shtora-tm.jpg'],
    [7383, 'Фисташковый', 'Фисташковий', 'https://images.prom.ua/4078996580_rulonna-shtora-tm.jpg'],
    [7435, 'Фиолетовый', 'Фіолетовий', 'https://images.prom.ua/4078997639_rulonna-shtora-tm.jpg'],
    [1870, 'Розовый', 'Рожевий', 'https://images.prom.ua/4078393177_rulonna-shtora-tm.jpg'],
    [877, 'Кремовый', 'Кремовий', 'https://images.prom.ua/4078976624_rulonna-shtora-tm.jpg'],
    [2057, 'Светло-желтый', 'Світло-жовтий', 'https://images.prom.ua/4079003690_rulonna-shtora-tm.jpg'],
    [7439, 'Мокко', 'Мокко', 'https://images.prom.ua/4079000977_rulonna-shtora-tm.jpg'],
    [852, 'Оранжевый', 'Оранжевий', 'https://images.prom.ua/4078404614_rulonna-shtora-tm.jpg'],
    [2074, 'Голубой', 'Блакитний', 'https://images.prom.ua/4079853481_rulonna-shtora-tm.jpg'],
    [7440, 'Графитовый', 'Графітовий', 'https://images.prom.ua/4079001748_rulonna-shtora-tm.jpg'],
    [881, 'Темно-бежевый', 'Темно-бежевий', 'https://images.prom.ua/4078977388_rulonna-shtora-tm.jpg'],
    [858, 'Желтый', 'Жовтий', 'https://images.prom.ua/4078969857_rulonna-shtora-tm.jpg'],
    [516, 'Красный', 'Червоний', 'https://images.prom.ua/4078396202_rulonna-shtora-tm.jpg'],
    [7436 , 'Светло-серый', 'Світло-сірий', 'https://images.prom.ua/4078998714_rulonna-shtora-tm.jpg'],
    [2075, 'Синий', 'Синій', 'https://images.prom.ua/4078982723_rulonna-shtora-tm.jpg'],
    [519, 'Темно-серый', 'Темно-сірий', 'https://images.prom.ua/4078398494_rulonna-shtora-tm.jpg'],
    [814, 'Капучино', 'Капучино', 'https://images.prom.ua/4078402088_rulonna-shtora-tm.jpg'],
    [2095, 'Терракотовый', 'Теракотовий', 'https://images.prom.ua/4078983373_rulonna-shtora-tm.jpg'],
    [2106, 'Коричневый', 'Коричневий', 'https://images.prom.ua/4078985872_rulonna-shtora-tm.jpg'],
    [2148, 'Бежевый', 'Бежевий', 'https://images.prom.ua/4078988251_rulonna-shtora-tm.jpg'],
    [602, 'Золотистый', 'Золотистий', 'https://images.prom.ua/4078399431_rulonna-shtora-tm.jpg'],
    [2001, 'Зеленый', 'Зелений', 'https://images.prom.ua/4078979614_rulonna-shtora-tm.jpg'],
    [7438, 'Сиреневый', 'Бузковий', 'https://images.prom.ua/4079000461_rulonna-shtora-tm.jpg'],
    [611, 'Лаванда', 'Лаванда', 'https://images.prom.ua/4078400211_rulonna-shtora-tm.jpg'],
    [7437, 'Мокко', 'Мокко', 'https://images.prom.ua/4078999734_rulonna-shtora-tm.jpg'],
    [2098, 'Оливковый', 'Оливковий', 'https://images.prom.ua/4078984279_rulonna-shtora-tm.jpg'],
    [2103, 'Кирпичный', 'Кірпічний', 'https://images.prom.ua/4078985068_rulonna-shtora-tm.jpg'],
    [2136, 'Черный', 'Чорний', 'https://images.prom.ua/4078986490_rulonna-shtora-tm.jpg'],
    [888, 'Бордовый', 'Бордовий', 'https://images.prom.ua/4078978076_rulonna-shtora-tm.jpg'],
    [2070, 'Светло-розовый', 'Світло-рожевий', 'https://images.prom.ua/4078393430_rulonna-shtora-tm.jpg'],
    [2142, 'Серый', 'Сірий', 'https://images.prom.ua/4078987417_rulonna-shtora-tm.jpg'],
    [2073, 'Мятный', "М'ятний", 'https://images.prom.ua/4078981832_rulonna-shtora-tm.jpg'],
    [875, 'Молочный', 'Молочний', 'https://images.prom.ua/4078975785_rulonna-shtora-tm.jpg'],
    [7430, 'Бирюзовый', 'Бірюзовий', 'https://images.prom.ua/4079860104_rulonna-shtora-tm.jpg'],
    [2071, 'Персиковый', 'Персиковий', 'https://images.prom.ua/4078980834_rulonna-shtora-tm.jpg'],
    [873, 'Салатовый', 'Салатовий', 'https://images.prom.ua/4078971641_rulonna-shtora-tm.jpg'],
    [7446, 'Фукусия', 'Фуксія', 'https://images.prom.ua/4079002656_rulonna-shtora-tm.jpg'],
    [874, 'Индиго', 'Індиго', 'https://images.prom.ua/4078973398_rulonna-shtora-tm.jpg'],
    [860, 'Коралл', 'Гірський кришталь', 'https://images.prom.ua/4079872752_rulonna-shtora-tm.jpg'],]

description = '''
<h3>Рулонная штора Лен ширина по ткани {} см высота 170 см. Цвет {}.</h3>
<h3>Как замерять ролеты лен?</h3>
<p>Нужно замерять ширину стекла оконной створки, на которое будет крепится ролета и прибавить 3 см. Если число получится не целое, то нужно округлить в большую сторону.</p> 
<p>Например: ширина стекла 53.5 см + 3 см = 56.5 см. Округляем в большую сторону = 57 см. Нужно выбрать ролету с шириной 57 см.</p> 
<p>Высота стандартная 160 см. При установке регулируется к размеру вашего окна.</p>

<h3>Комплектация рулонных штор Лен.</h3>
Ролета изготовлена из ткани Миранда польського производства. 
<ol>
<li> Ролета Лен на алюминиевом валу.</li>
<li> Качественная фурнитура польского производства.</li>
<li> Направляющие струны.</li>
<li> Фиксатор направляющей струны.</li>
<li> Цепочка управления. Можно установить справа или слева.</li>
<li> Ограничитель высоты шторы.</li>
<li> Фиксатор цепи.</li>
</ol>
Саморезы для крепления в комплект не входят.
'''

description_ua = '''
<h3>Рулонна штора Льон ширина по тканині {} см висота 160 см. Колір {}.</h3>
<h3>Як заміряти ролету льон.</h3>
<p>Потрібно заміряти ширину скла віконної рами, на яке буде кріпитися ролета та додати 3 см. Якщо число вийде не ціле, то потрібно округлити в більшу сторрону.</p> 
<p>Наприклад: ширина скла 53.5 см + 3 см = 56.5 см. Округляємо в більшу сторону = 57 см. Потрібно вибрати ролету з шириною 57 см.</p> 
<p>Висота стандартна 160 см. Під час встановлення регулюється під розмір вашого вікна.</p>

<h3>Комплектация рулонных штор льон.</h3>
Ролета виготовлена з тканини Міранда польського виробництва.  
<ol>
<li> Ролета льон на алюмінієвому валу.</li>
<li> Якісна фурнітура польського виробництва.</li>
<li> Направляючі струни.</li>
<li> Фиксатор направляючих струн.</li>
<li> Цепочка управління. Можливе встановлення зправого або злівого боку.</li>
<li> Обмежувач висоти ролети.</li>
<li> Фіксатор цепка.</li>
</ol>
Саморізи для кріплення в комплект не входять.
'''